{"schedule": {"version": "0.8", "base_url": "https://pretalx.evolutio.pt/pycon-pt-2023/schedule/", "conference": {"acronym": "pycon-pt-2023", "title": "PyCon Portugal 2023", "start": "2023-09-07", "end": "2023-09-09", "daysCount": 3, "timeslot_duration": "00:05", "time_zone_name": "Europe/Lisbon", "rooms": [{"name": "Auditorium", "guid": null, "description": null, "capacity": 230}, {"name": "Workshop I", "guid": null, "description": null, "capacity": 120}, {"name": "Workshop II", "guid": null, "description": null, "capacity": 120}], "days": [{"index": 1, "date": "2023-09-07", "day_start": "2023-09-07T04:00:00+01:00", "day_end": "2023-09-08T03:59:00+01:00", "rooms": {"Auditorium": [{"id": 694, "guid": "4d0141fd-3698-5a06-8057-69a661e93004", "logo": "", "date": "2023-09-07T09:00:00+01:00", "start": "09:00", "duration": "00:15", "room": "Auditorium", "slug": "pycon-pt-2023-694-welcoming-session", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/D3JKUW/", "title": "Welcoming Session", "subtitle": "", "track": null, "type": "Other", "language": "en", "abstract": "Welcoming Session", "description": "Welcome to PyCon Portugal 2023, the second edition.\r\n\r\nMiguel Fonseca, Councillor at Coimbra City Council, will give us a warm welcome to the city.\r\nAlexandre Miguel Fernandes Gomes da Silva, President of Coimbra Business School, will welcome us to this School, as hosts of this year's edition.", "recording_license": "", "do_not_record": false, "persons": [{"id": 462, "code": "7GZJDL", "public_name": "Luis Vaz", "biography": "Miguel Fonseca is a full-time councillor at Coimbra City Council, responsible for Economy, Accounting and Finance; Control and Planning; Assets and Supplies; Administrative Offences and Tax Enforcement; Trade and Industry; Municipal Markets and Fairs; and Entrepreneurship, Investment and Employment.\r\nHe has a degree in Economics from the Faculty of Economics of the University of Coimbra, a Master's degree in International Economics and a PhD in Economics from the Higher Institute of Economics and Management/University of Lisbon (ISEG). \r\nHe was an Assistant Professor at the Faculty of Economics of the University of Porto, a researcher in the scientific area of Internationalisation and a member of ISEG's Centre for Studies on Africa and Development, as well as a member of the board of the Centre and Alentejo Regional Delegation of the Order of Economists. He is currently a member of the National Board of the Order of Economists.\r\nHe has experience in local government, having been president of the Sé Nova Parish Council (2001-2005 and 2005-2009) and a member of the Coimbra Municipal Assembly (2009-2013), elected by the CDS. \r\nHe has strong ties to Coimbra's cultural and sporting institutions, being 1st Tenor of the Choir of the Former Orpheonists of the University of Coimbra and a founding member of CLASSE T - O Teatrão's Amateur Theatre Group. He was a member of the Supervisory Board of Associação Académica de Coimbra-Organismo Autónomo de Futebol and Associação Académica de Coimbra-Organismo Autónomo de Futebol, SDUQ, Lda.", "answers": []}, {"id": 685, "code": "7BZFQL", "public_name": "Alexandre Miguel Fernandes Gomes da Silva", "biography": "Degree in Applied Mathematics, Coimbra Portugal. MSc Statistics University College Dublin, PhD Statistics University of Reading, UK- Coordinating Professor at ISCAC | Coimbra Business School. Founder, director and technical supervisor of PolLab, center for market studies and surveys. Created and is Coordinator of the master's degree Data analysis and decision support systems. Member of CEISUC research team as an \"integrated researcher\" - Faculty of Economics, University of Coimbra. Member of several scientific associations.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 688, "guid": "46c71aa7-40ac-5353-8fec-12f78b8ba08b", "logo": "", "date": "2023-09-07T09:15:00+01:00", "start": "09:15", "duration": "01:00", "room": "Auditorium", "slug": "pycon-pt-2023-688-optimising-for-joy", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/QLZHM3/", "title": "Optimising for joy", "subtitle": "", "track": null, "type": "Keynote", "language": "en", "abstract": "The good feeling new developers get when they begin to program for the first time fades as we get more experience and learn more. Is it possible to recapture that feeling?", "description": "New developers experience excitement through an abundance of things to learn and improve, often leading to a positive feedback loop of visible and rewarding progress.\r\n\r\nHowever as we gain experience and proficiency new ideas, techniques and knowledge become increasingly more complex, and so it becomes challenging to sustain the same level of enthusiasm.\r\n\r\nHow can we overcome this hurdle so that we can all fall back into that rewarding feedback loop again, and reignite the joy and satisfaction that code can bring?", "recording_license": "", "do_not_record": false, "persons": [{"id": 675, "code": "BJWYLZ", "public_name": "Tom Forbes", "biography": "I’m a passionate believer in enabling engineers to focus on the interesting parts of their job and less on the mundane; through elegant tooling, automation and fantastic developer experiences. Happier developers supported by great tooling build better products.\r\n\r\nMy work at Octopus Energy focuses this passion towards helping our engineers drive the green energy revolution across the world.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 655, "guid": "4577760c-c5e4-5d24-ae61-455d59cad8c8", "logo": "", "date": "2023-09-07T10:15:00+01:00", "start": "10:15", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-655-amazon-codewhisperer-chatgpt-and-github-copilot-choosing-the-best-python-ai-code-assistant", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/DQMACQ/", "title": "Amazon CodeWhisperer, ChatGPT, and GitHub Copilot: Choosing the Best Python AI Code Assistant", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Discover the right helper for your Python coding needs. Explore security, code readability, cut-off limitations, creativity, ability to generate tests, and troubleshooting capabilities. Find survey results for programmers.", "description": "Given the recent boom of AI code assistants, more and more programmers are starting to use them to increase their day-to-day performance and delegate some routine tasks. But how to choose a suitable and robust helper? Is this possible at the moment?\r\n\r\nDuring this talk, we are going to compare 3 AI code assistants for Python: ChatGPT, GitHub Copilot, and Amazon CodeWhisperer. \r\nThe criteria will be as follows:\r\n- **security**: how passwords & SQL queries are being handled\r\n- **code readability**: is generated code easy to follow?\r\n- **cut-off date**: what is the latest knowledge of assistant (Python version, packages awareness)\r\n- **creativity**: given a certain code, how good is the assistant at creating a Streamlit app?\r\n- **code testing**: the ability to generate unit tests to code for different scenarios\r\n- **debugging/troubleshooting**: the ability to find an error or to handle it\r\n\r\nIn addition to comparison, the results of the programmers' AI code assistants usage survey will be shared. By the end of this talk, attendants will have a good understanding of the differences between AI code assistants for Python, and they will be aware of the possible advantages/disadvantages of each mentioned assistant.", "recording_license": "", "do_not_record": false, "persons": [{"id": 653, "code": "MQF8UQ", "public_name": "Darya Petrashka", "biography": "Data Scientist, passionate about data and its usage for problem-solving. \r\nDarya's area of interest includes classical ML and NLP, LLMs, and GenerativeAI as well as working with AWS services. She is an active AWS Community Builder since August 2022.\r\nLive-longer learner, taking part in online schools, courses, and workshops. Besides, Darya likes to challenge herself in hackathons.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 615, "guid": "415ea7c8-d5c6-50d5-99f8-843bf851a61b", "logo": "", "date": "2023-09-07T11:20:00+01:00", "start": "11:20", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-615-a-simple-serverless-data-pipeline", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/AU7WHA/", "title": "A simple serverless data pipeline", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Building and maintaining data pipelines when it’s not your full time job is a pain! So better keep things simple without the need to manage the system yourself. In this talk I’ll show a data pipeline architecture built leveraging some cloud offerings by AWS and Preset.", "description": "Building and maintaining data pipelines when it’s not your full time job is a pain! So better keep things simple without the need to manage the system yourself. In this talk I’ll show a data pipeline architecture built leveraging some cloud offerings by AWS and Preset.\r\n\r\nIn this talk we’ll discuss:\r\n- an overview of the architecture\r\n- the data lake: AWS S3, AWS Athena\r\n- the exploration and visualization platform: Apache Superset\r\n- data formats and Python implementations\r\n- vendors lock-in", "recording_license": "", "do_not_record": false, "persons": [{"id": 340, "code": "RSWFLW", "public_name": "Riccardo Magliocchetti", "biography": "Riccardo is a Python software developer and consultant. In the years has contributed to quite a different range of open source software.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 576, "guid": "e5f74614-dc94-5fa7-b881-66235c411527", "logo": "", "date": "2023-09-07T11:55:00+01:00", "start": "11:55", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-576-building-dainty-dashboards-in-plotly-dash-for-health-data-science-", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/BQVEPV/", "title": "Building Dainty Dashboards in Plotly Dash for health data science.", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Data science projects are often characterized by visualizations which \r\nenhances the creative storytelling process and allow us to derive actionable \r\ninsights from data. This is enabled through the use of good visualization tools/libraries which enable us to present data in a manner that is interactive and is easily understandable. Often, the action in itself tends to be more significantly remembered by the audience in comparison to static insights. This inturn \r\ncalls for the need for using interactive dashboards as a way to present the data.  \r\nCurrently, the plethora of tools available for this purpose often makes it a tedious task to decide which is the best fit. Often the choice oscillates between learning to use explicit dashboarding tools or using existing python libraries which may allow visualizations but not necessarily dashboarding. \r\nApart from the cost associated with some of these explicit dashboarding tools, there might also be a learning curve associated with it.  \r\nTherefore, in this talk, I would like to take you through a simple pythonic approach of building dainty dashboards using Plotly Dash in python to ease the process of data exploration and allow for interactive visualizations that enable creative storytelling.", "description": "In this talk, we would be looking at Plotly Dash as an interactive dashboarding tool for data exploration through creative and informative visualizations. Familiarity with python would be a pre-requisite. The format of the talk is informative and hands-on. We would be creating a dashboard along the way following the learning by doing approach. We would be using an open source healthcare dataset available online for the purpose of creating these visualizations. Further we'll cover the following topics: \r\n1. Introduction: A bit about Plotly Dash and why you should use it.\r\n2. Taking First steps: Exploring functions for loading data.\r\n3. Boilerplate code for our Dash app.\r\n4. A bit about Dash Core Components.\r\n5. Diving into visualizations - Adding various figures, charts, graphs to our dashboard.\r\n6. Experimenting with dashboard layouts.\r\n7. Interaction between app components: Looking at callback functions.\r\n8.  Finally, hosting the app for the world to see!", "recording_license": "", "do_not_record": false, "persons": [{"id": 596, "code": "ASJFWF", "public_name": "Avneet Kaur", "biography": "I am currently working as a Data Engineering Professional at Novo Nordisk. I am inspired by the advancing developments in making computers imitate and understand human language, vision, and intelligence and passionate about building tech that adds value to society.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 614, "guid": "696df3a2-6b6a-5df0-bc70-615bf7a6c5cd", "logo": "", "date": "2023-09-07T12:30:00+01:00", "start": "12:30", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-614-tools-to-setup-great-python-projects", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/XBTDUJ/", "title": "Tools to setup great python projects", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "In a professional python project, there are many steps one can take to improve its quality. In this talk, I will review some tools that have been useful to me:\r\n\r\n- package managers\r\n- code formatters\r\n- code linters\r\n- test runners\r\n- python manager\r\n\r\nI will also talk about centralizing the configuration so different tools can act consistently, eg CLI, IDE and CI/CD.", "description": "Edit: I created a small demo in [Github](https://github.com/duarte-pompeu/great-tools-pyconpt23), if you're interested.\r\n\r\n# Package managers\r\n\r\n- no package manager is a (very) bad idea\r\n- requirements.txt is a good improvement, but makes it harder to do some things, eg lock sub-dependencies versions and specify development-only dependencies \r\n- pipenv is good, but I prefer poetry\r\n\r\n# Python manager\r\n\r\n- pyenv makes it easy to install and manage multiple python versions\r\n\r\n# Code formatters\r\n\r\n- black: formats the code (\"any color you want, as long as it's black\")\r\n- isort: sorts the imports (\"i sort so you don't have to\")\r\n- darker: formats code only since last commit (gradual formatting for older projects)\r\n\r\n# Code linters\r\n\r\n- pylint: decent start but too many false positives\r\n- pycodestyle: popular, didn't use it much\r\n- flake8: popular and used it a bit, it's ok\r\n- ruff: the cool kid in the block: much faster and supports rules from different [linters](https://beta.ruff.rs/docs/rules/)\r\n\r\nHonorable mentions: bandit, bugbear, pyupgrade\r\n\r\n# Test runners\r\n\r\n- unittest: native, it's decent but verbose\r\n- pytest: widely used, supports plugins\r\n- locust: didn't use it much but potentially useful for load testing\r\n- hypothesis: property based testing\r\n\r\n# Centralized configuration\r\n\r\nCentralize your configs in pyproject.toml such that every application runs the tools consistently:\r\n   - CLI\r\n   - IDE\r\n   - git hooks / pre-commit\r\n   - CI/CD\r\n\r\nflake8 didn't support pyproject.toml because [it wasn't standard](https://github.com/PyCQA/flake8/issues/234#issuecomment-812800722) - well now it is, in [PEP 621](https://peps.python.org/pep-0621/), but it doesn't support it anyway. Bad flake8!", "recording_license": "", "do_not_record": false, "persons": [{"id": 606, "code": "NMESZQ", "public_name": "Duarte Pompeu", "biography": "Hi, I'm Duarte. I'm a software engineer since 2019, and my passions are architecture, clean code, incremental development and refactoring. I can also make some mean Moscow Mules! \r\n\r\nAlso here's the link to my [linkedin](https://www.linkedin.com/in/duartepompeu). Link, Linkedin, get it? Sorry.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 685, "guid": "23033007-3bad-5f19-95a5-5851333aa7de", "logo": "", "date": "2023-09-07T14:05:00+01:00", "start": "14:05", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-685-legacy-apps-deadlines-and-project-pragmatism-delivering-thousands-of-messages-every-night-in-primary-healthcare", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/T9QPRH/", "title": "Legacy apps, deadlines and project pragmatism - Delivering thousands of messages every night in primary healthcare", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "In my talk I will go over the story of how I set up the service that sends text message reminders to patients of the Portuguese primary care health system. I will explain the constraints of working with a distributed silo legacy application and other proprietary projects in a large company, and the impact of that and short deadlines on application design. Python shines through the project for its vast amazing libraries, ease of design and speed of iteration.", "description": "1. Introduction\r\n\r\nIn 2022, in the aftermath of the COVID pandemic peak, the problem of absences in patient healthcare appointments in primary care was revisited. There was also a need to catch up to the backlog of appointments that were cancelled. In order to maximize attendance, it was decided that patients should get reminders of their scheduled appointments, by text message, as SPMS, the Shared Services of the Ministry of Health had had a great experience with them in the vaccination scheduling effort.\r\n\r\nHowever, the team working on Primary Care was still fully committed to the vaccination scheduling system and other tasks. The deadline was also short, basically \"As soon as possible\". And I was the only one available to do it.\r\n\r\nWho am I? Well, I'm a doctor, a family doctor to be more exact. A year and a half ago from starting this project, I was treating COVID patients in full protection suit. And as of that moment, I was a scientific consultant for Health apps. Doesn't mean I didn't spend a lot of time coding, as I had already some deployed internal apps, including a FastAPI service for your first vaccination schedule date.\r\n\r\n2. Technical challenges\r\n\r\nThe task sounds simple when thinking about modern systems. Collect the upcoming appointments from the Electronic Health Record (EHR), and use a service to send the messages. However, the Portuguese primary care EHR is fragmented into multiple instances that serve a region. And the text message service used had to be a SOAP service. Given the timeframe and the fact that I still had to deliver on my other assignments, some compromises had to be made.\r\n\r\n3. Shortcuts\r\n\r\nThe first and biggest shortcut to take has to be data gathering. I have to collect the data directly from the databases, as there was no time for anything else. This couples my app to the EHR data structure but it's a compromise we are willing to make.\r\n\r\nI also can’t get an actual database for my app in a short time, but I can settle for Redis. It's fast to develop with Key Value databases, it won't be a bottleneck and I can log message sending successes or failures (if there is a need to retry).\r\n\r\nConfiguration can be made from environment variables.\r\n\r\nAnd we'll host it all on a machine we already have, using a pipeline we're familiar with... that turned out to be kubernetes K3s.\r\n\r\nOur enterprise ecosystem is made up mostly from Java apps, with legacy systems using PL-SQL. So of course I had to go with python.\r\n\r\nWhy python? Because we can interact with oracle databases with a robust package (cx-oracle, now oracle-db), use a SOAP service easily with Zeep, schedule tasks with Celery, create an API to access information with FastAPI, and ensure someone else can take over really fast if we fall ill with COVID. And we can do it in a week if we have to.\r\n\r\n4. Choose well the corners you cut\r\n\r\nDon’t cut testing. At some point you start thinking that this thing you're building will actually cost money. And if we send the wrong message, we can cost someone their appointment or worse, leak personal information. There are a lot of things that can go wrong. So we must make it bullet proof. That meant creating tests for the integrations that might fail, and all of the logic. And that allowed constant improvements of the not so good code to something that has been going non stop for a year.\r\n\r\nDeployment. I can either deploy extremely fast today with a manual deployment and then suffer for eternity... or I can do it well, not perfectly but well enough. It's especially good when you can reuse tried and tested pipelines, so there is a compromise to be made here. \r\nIt can't fail, it can't wait for too long but it must also mean it's easy to redeploy new versions as often as needed.\r\n\r\n5. Things you can't avoid\r\n\r\nEverything in a large corporation takes longer than you wish. Want credentials to a service? Request, sign, wait. Access to databases? Wait for grants. Wait some more for firewall access. Clarification on the actual text of the message? Take a number. A pandemic is still happening and we need everything to both wait and happen simultaneously.\r\nEverything feels both expedited and extremely slow in the corporate world. It's demoralising sometimes because it contrasts with the extreme speed with which you're developing with the snail pace of getting someone to stop what they're doing and solve a ticket for you. It goes with the privilege of serving a whole country. It pays off, but it takes time.\r\n\r\n6. What happens the day after?\r\n\r\nWell, after you deliver that extremely urgent project, you can actually start to make it good. The pilot is only sending a hundred messages, but to send thousands, you must use async or threads. But you can't just push everything at once, you'll crash the message service.\r\nAnd the code is still terrible so it's time to refactor, because soon enough people will start to think of new things to put into the service. If everything is coupled, implementing new rules will start making big messes. If you're afraid to make changes, it's because you can't trust your tests to protect you.\r\n\r\nThe key takeaway is, every time you make a new feature, leave the code better than you found it. Everything can't be an emergency every time. This certainly wasn't. At some point you have to say \"I can't do that in that amount of time\". Compromises can be reached, but they must always include tech debt repayment warranties.\r\n\r\n7. How's it going?\r\n\r\nI'm fine, thank you. And the service is fine too!\r\nThe service is still only available to about half of the population, mostly in Lisbon. But as of the 21st of June 2023, we have sent more than five million messages. Some days we send more than 70 000. Not too bad for a service made by a doctor.", "recording_license": "", "do_not_record": false, "persons": [{"id": 671, "code": "YPYG8X", "public_name": "Joao Ferreira", "biography": "I'm a family doctor by trade, however I've been coding for much longer than I've been working, and most of that time, it's been in Python. Today, I help make Healthcare better in the Shared Services of the Ministry of Health.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 622, "guid": "f653576a-70c4-5284-b9fb-7e36e23c0071", "logo": "/media/pycon-pt-2023/submissions/UUSU9N/Lucas_hackathons_2_g3iPsZu.jpg", "date": "2023-09-07T14:40:00+01:00", "start": "14:40", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-622-artificial-intelligence-running-on-the-blockchain", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/UUSU9N/", "title": "Artificial Intelligence running on the Blockchain", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "New technology now allows machine learning models to be uploaded to the blockchain, enhancing decentralized applications' (dapps) functionality and competitiveness against centralized apps. In this talk, we will discuss how anyone can easily deploy a simple machine learning model to the blockchain.", "description": "Until now, dapps have never been able to incorporate machine learning models. Therefore, it is hard for a dapp such as DTube to compete against centralized apps such as YouTube that can offer better content recommendations to their users. \r\nNow, you can finally upload your machine learning model to the blockchain, to use in dapps, protocols, or cryptocurrencies. This technology will be explained in detail and how anyone can easily deploy a very simple machine learning model to the blockchain.\r\n\r\nThe talk addresses the challenge of integrating machine learning models into decentralized applications (dapps). This has historically been a barrier, limiting the competitiveness of dapps against their centralized counterparts. The session will provide insights on how to deploy and leverage ML models on the blockchain, thus empowering dapps to deliver more personalized and advanced services. It aims to facilitate the convergence of AI and blockchain for enhanced application development.\r\nThe goal is for attendees to leave with a clear understanding of how to deploy machine learning models on blockchain; and to see the potential of blockchain and AI convergence in creating more personalized, secure, and efficient dapps, thus bridging the gap between decentralized and centralized applications. It is also aimed to foster innovation and collaboration in the blockchain space.", "recording_license": "", "do_not_record": false, "persons": [{"id": 626, "code": "ELJJRP", "public_name": "Lucas", "biography": "Lucas Roitman is an entrepreneur and researcher best known for his inventions and research in the field of Artificial Intelligence, Robotics, and Augmented Reality. Roitman's success began at age 11, when he created his first viral video game, and it continued later on when he created and sold his first augmented reality software to a multinational company, becoming one of the youngest self-made millionaires in the world. Besides becoming a three-time Olympic medalist in informatics and represented the nation twice internationally, in Italy and Thailand, for the IOI competitions, he also became an international Olympic medalist in the Ibero-American olympiads.\r\nAfter receiving several scholarships from prestigious institutions such as MIT, Yale, and Stanford in the United States, he chose to join Stanford University in California, where he graduated with honors. While studying there, he was selected to participate in programs at Berlin and Peking University. After creating the start-up Lighthouse, an advanced technology camera for home security that was eventually sold to Apple, Roitman began to develop his own smart drone company called Adia Robotics, and he is currently working on various confidential projects within Apple, as well as creating a startup to enable Artificial Intelligence to run on the blockchain. Lucas Roitman is still a part of the Research Department at Stanford University, where he periodically publishes papers on Artificial Intelligence, machine learning, science, and technology, as well as business and entrepreneurship.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 630, "guid": "92a01c70-f250-50dd-b4d1-c9d2e82c3e28", "logo": "", "date": "2023-09-07T15:15:00+01:00", "start": "15:15", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-630-the-aesthetics-of-unbiased-machine-learning-systems-crafting-fairness-in-practice", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/NBFQUX/", "title": "The Aesthetics of Unbiased Machine Learning Systems: Crafting Fairness in Practice", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "In Artificial Intelligence systems, a renaissance has unfolded in recent years, captivating the imagination of many! However, a startling statistic emerges amidst the enthusiasm: merely 13% of machine learning models are deployed into production!\r\n\r\nIndeed, the artistry of building and deploying these systems supersedes mere scientific methodology as these models dwell within the realm of complexity and are characterized by an inherent reliance on data distribution. Have you ever wondered if these models are trained upon biased data they are destined to produce haywire decisions?\r\n\r\nIn this talk, let us delve into the realm of ethicality, fairness, and unbiasedness, culminating in the seamless integration of machine learning models that embrace ethical considerations in their journey towards production using Python!", "description": "Have you ever wondered why the increasing reliance on Machine Learning systems raises concerns about fairness and bias in their data-driven decisions? What if ML models are built on skewed data or are not designed to mitigate bias - then they can perpetuate and even amplify existing inequalities and injustices!\r\n\r\nSince there's no one-size-fits-all approach, thus, building and deploying a fair and unbiased ML system is more of an art than a science! In this talk, firstly, we will explore the challenges involved in building and deploying fair and unbiased ML systems. Secondly, we will understand the technical debts which incur while building such systems and how to investigate them. Finally, we will learn fundamental strategies and best practices for ensuring your ML models are fair, unbiased, and ethical!", "recording_license": "", "do_not_record": false, "persons": [{"id": 631, "code": "SVMWFM", "public_name": "Rashmi Nagpal", "biography": "Rashmi is a skilled Software Engineer at Cactus and a researcher at the University of San Francisco, working in Machine Learning. With nearly four years of experience in the IT industry, she has successfully spearheaded product ideation and led redesigns and feature development, reaching millions of users. Rashmi indulges in astronomy, capturing images of the cosmos with her telescope or unwinding with friends over board games when she is not occupied with coding. Additionally, Rashmi is a proud pet parent to her Maltese breed dog, Fluffy.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 586, "guid": "6ee6e093-39f7-56fe-a59b-908af5695816", "logo": "", "date": "2023-09-07T16:20:00+01:00", "start": "16:20", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-586-weird-python-a-few-ways-in-which-python-can-misbehave", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/RPVSHN/", "title": "Weird Python: A few ways in which Python can misbehave", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Python usually works the way we expect to, but sometimes it doesn't. This talk is about when to expect the unexpected.", "description": "Python has some weird interpreter quirks that behave in unexpected ways. In this talk, we will go over a few ways in which Python behaves unexpectedly:\r\n\r\n- Introduction: What this talk is about, and why it is important to steer clear of some known \"gotchas\"\r\n- Meat of the Talk: Going over examples of ways in which Python behaves weirdly:\r\n1. Mutable default arguments: When we provide mutable default arguments, some strange things might happen.\r\n2. Integer Caching: This is how the `is` operator can behave in weird ways, and sometimes it is not between -5 and 256 that the `is` operator works.\r\n3. Late Binding Closures: Python *late-binds* when creating functions within another function.\r\n4. Match/Case Weirdness: Match/Case statements actually assign the variables when binding values to variables.\r\n- Questions/Answers", "recording_license": "", "do_not_record": false, "persons": [{"id": 360, "code": "H9Y9HV", "public_name": "Quazi Nafiul Islam", "biography": "Nafiul is a Software Engineer with over a decade of experience. He wrote a book called \"Mastering PyCharm\" and has spoken at multiple conferences. He has always been passionate about developer tools, and loves learning about new ones and understanding how they work.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 660, "guid": "579e5cf8-5135-5f01-a5cf-9ef960760e76", "logo": "", "date": "2023-09-07T16:55:00+01:00", "start": "16:55", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-660-tavern-crawler-a-tool-to-enable-fast-and-easy-development-of-automated-api-tests", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/UNF8WJ/", "title": "Tavern Crawler: a tool to enable fast and easy development of automated API tests", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Tavern is an open source pytest plugin aimed to write automated integration tests for HTTP and MQTT APIs. Currently, there isn’t any UI support for it. This talk presents a Visual Studio Code extension that enables easy and fast writing of Tavern tests .", "description": "Tavern is an open source pytest plugin aimed to write automated integration tests for HTTP and MQTT APIs. Although based in pytest, the tests are specified in the YAML format, which makes support out-of-the-box in major Python IDEs, such as PyCharm or Visual Studio Code, not possible. \r\n\r\nTavern Crawler was developed to address the non-existence of a Tavern UI tool. The tool is a Visual Studio Code (VSCode) extension, with an interface loosely based in VSCode’s Test Explorer, so that developers feel immediately familiar working with it. Having such tool eases writing tests, which can become difficult especially when the number of tests and its complexity increases; and also enables quick visual assessment of the state of these.\r\n\r\nThis talk will address the following topics:\r\n1. Brief introduction to Tavern\r\n2. Issues with large Tavern projects and why an UI is important\r\n3. Present and explore the Tavern Crawler extension with live examples\r\n4. Lessons learned and the future of Tavern Crawler", "recording_license": "", "do_not_record": false, "persons": [{"id": 657, "code": "XWDBED", "public_name": "Jorge Miranda", "biography": "Telecommunications engineer who fell in love with embedded systems and, eventually, made a PhD in electronics. In the last years I’ve been working in the development of embedded systems for healthcare applications and other Internet of Things related projects. As an hobby, I try to be a rock star with a guitar.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 656, "guid": "e0c047cb-aacd-5154-b5de-78e6716d4895", "logo": "", "date": "2023-09-07T17:30:00+01:00", "start": "17:30", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-656-revealing-perspectives-the-art-of-data-insight-communication-in-the-data-driven-projects", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/L9FNWG/", "title": "Revealing Perspectives: The Art of Data Insight Communication in the Data-Driven Projects", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "\"Unveiling Perspectives: The Art of Data Insight Communication in the Data-Driven Projects\" is an engaging presentation that emphasizes the criticality of effectively communicating findings and insights in the field of Data Science. Often overlooked, the final stage of a data-driven project involves presenting results to stakeholders. This talk sheds light on the importance of this stage and explores the art of presenting findings, storytelling, and employing interactive methods to convey complex information in an intuitive manner. By leveraging powerful Python tools such as PyShiny, FastAPI, Streamlit, Flask, and ReactPy, participants will gain insights into how to effectively utilize these tools to enhance their data analysis and ensure understandability and memorability. In addition, the session will touch upon color science principles and other intriguing elements. The speaker will showcase a real-life data-driven project and demonstrate their innovative solution for result communication, providing practical examples and valuable takeaways.", "description": "In the world of Data Science, the ability to effectively communicate findings and insights is paramount. However, this crucial aspect is often overlooked, with researchers dedicating their efforts solely to the analytical stages of a data-driven project. My talk seeks to rectify this oversight by highlighting the significance of the final stage—presenting results to stakeholders—and exploring innovative techniques to make this process engaging and impactful.\r\n\r\nDuring this enlightening talk, participants will embark on a journey through the power of Python and its versatile tools such as PyShiny, FastAPI, Streamlit, Flask, and ReactPy. I will delve into practical use cases and share insights on when and how to leverage these tools effectively to enhance data analysis and visualization. Attendees will discover how to transform their findings into intuitive narratives, captivating stakeholders by immersing them in interactive experiences that facilitate a deeper understanding of complex data.\r\n\r\nMoreover, this session will go beyond technical aspects and touch upon the importance of color science in data visualization. Participants will gain an appreciation for the role of color in conveying meaning, mood, and emphasis, ultimately improving the overall impact of their presentations.\r\n\r\nThe highlight of the presentation will be the speaker's real-life data-driven project, where they will showcase their own solution for result communication. Through a live demonstration, attendees will witness firsthand how the power of effective storytelling and interactive visualization can transform a dry set of numbers into a compelling narrative.\r\n\r\n\"Revealing Perspectives: The Art of Data Insight Communication in the Data-Driven Projects\" promises to be an engaging and informative session, providing attendees with valuable insights, practical examples, and actionable techniques to elevate their data analysis and ensure their findings are communicated with clarity and impact.", "recording_license": "", "do_not_record": false, "persons": [{"id": 651, "code": "X3ZFEA", "public_name": "Anastasiia Kostiv", "biography": "Anastasiia Kostiv is a highly skilled and experienced Data Scientist with a diverse background spanning multiple industries. With over 5 years of hands-on experience working with complex datasets, she has made significant contributions in healthcare, finance, and game analytics domains. Anastasiia's proficiency in a wide range of tools and technologies, including Python, R, advanced SQL queries, ML, Shiny, Plumber, Node.js, Reactjs, React Native, and API development, has enabled her to effectively analyze and interpret data using the latest statistical and machine learning techniques.\r\n\r\nOne notable accomplishment in Anastasiia's career was her involvement in designing and implementing a robust data management system for the Barcelona office of the World Health Organization. Her expertise proved instrumental in developing dashboards for the International Finance Corporation, a sister organization of the World Bank. Recently, Anastasiia made significant contributions to the \"Bohemia\" project, a groundbreaking clinical trial aimed at evaluating the efficacy of Ivermectin in reducing malaria-related mortality among children under five in Sub-Saharan Africa. Recognizing a data retrieval issue faced by the project, she took the initiative to develop a dockerized cloud endpoint/API using R and Plumber, effectively addressing the problem.\r\n\r\nBeyond her professional endeavors, Anastasiia demonstrates a strong passion for learning and innovation. During her spare time, she actively engages in personal projects, such as writing her own R packages and widgets. She also enjoys creating intricate Slack bots using R and Python. To further enhance her skills and knowledge, Anastasiia continuously seeks growth opportunities through various online courses.\r\n\r\nWith her exceptional expertise, dedication, and track record of successful projects, Anastasiia Kostiv stands as a valuable asset in the field of data science, contributing to cutting-edge solutions and advancements across diverse industries.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 695, "guid": "73a07123-9b58-58c4-9fe9-bf75fb378159", "logo": "", "date": "2023-09-07T18:05:00+01:00", "start": "18:05", "duration": "00:30", "room": "Auditorium", "slug": "pycon-pt-2023-695-lightning-talks", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/HTYYU7/", "title": "Lightning Talks", "subtitle": "", "track": null, "type": "Other", "language": "en", "abstract": "Lightning Talks", "description": "Lightning Talks", "recording_license": "", "do_not_record": false, "persons": [], "links": [], "attachments": [], "answers": []}]}}, {"index": 2, "date": "2023-09-08", "day_start": "2023-09-08T04:00:00+01:00", "day_end": "2023-09-09T03:59:00+01:00", "rooms": {"Auditorium": [{"id": 696, "guid": "8b3aa14f-c040-53e0-b88d-913c70833457", "logo": "", "date": "2023-09-08T09:00:00+01:00", "start": "09:00", "duration": "00:15", "room": "Auditorium", "slug": "pycon-pt-2023-696-morning-announcements", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/HGXJSK/", "title": "Morning Announcements", "subtitle": "", "track": null, "type": "Other", "language": "en", "abstract": "Morning Announcements", "description": "Morning Announcements", "recording_license": "", "do_not_record": false, "persons": [], "links": [], "attachments": [], "answers": []}, {"id": 673, "guid": "f4788b8c-57ff-511a-8e5e-e38f8f842595", "logo": "", "date": "2023-09-08T09:15:00+01:00", "start": "09:15", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-673-cpython-survival-kit-basic-c-concepts-to-understand-python-better", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/GBYCCH/", "title": "CPython Survival Kit: basic C concepts to understand Python better", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "The newest Python versions are including many changes that improve the performance and functionality, but what's going on under the hood? In this talk, you will learn the necessary topics  to start discovering how CPython internals work, and how to create a new module based in C or C++.", "description": "Everyone is happy with what Python 3.11 and the future 3.12 is bringing to the Python ecosystem, but in case you haven't heard already of the improvements, most of them were made at the core of CPython to affect the interpreter.\r\n\r\nIt is very probable that many people out there, have ideas that can help Python to be better, but for that, you would need to dive into the CPython code at some point, and possibly perform modifications in C.\r\n\r\nA subset of the API is indeed written in Python, but most of the other crucial core components are written in C - and with that, many people might not know C so well.\r\nThe main building block of the internals, the PyObject, is a particular C-structure with many details and components that are worth studying, similarly, basic functions Python programmers use intensively like the print function, lists, dictionaries, etc - have C at their core.\r\n\r\nThe main objective of this talk is to motivate people to start being involved in low-level languages that make Python better, mainly not being afraid into picking up a bit of C knowledge to continue improving the core of CPython, and the many solutions out there that allow you to optimize the code, bindings, and why not, the creation of the 'next' blazing fast and performant module that will improve many peoples lives.\r\n\r\nAfter this talk, you will be able to modify Python's functionality from its core, add new API, create your new C-based Python modules, and more.\r\nSome ideas of C would be good, but not necessary.\r\n\r\nOutline:\r\n- Highlights of new things in 3.11 and 3.12\r\n- How Python works internally?\r\n+ CPython introduction and repo overview\r\n+ PyObject description\r\n+ Explain how data types works (lists, sets, ...)\r\n- Super brief introduction to the most important features of C to understand CPython\r\n- Creating a C-based extension for Python\r\n- Modifications to the common python functionality.", "recording_license": "", "do_not_record": false, "persons": [{"id": 665, "code": "8DMJYJ", "public_name": "Cristián Maureira-Fredes", "biography": "Hello! My name is Cristián and I currently work as Sr. R&D Manager at The Qt Company. One of my main responsibilities is the Qt for Python project (PySide/Shiboken), which is the set of official bindings of the Qt Framework to Python. In my day to day, I work with C++, Python and CPython, which are usually the topics of my talks. In my spare time, I like to collaborate with Open Source communities, mainly Python such as Python en Español https://hablemospython.dev, Python Chile https://pythonchile.cl, Python España https://es.python.org, and conferences like PyConUS and Europython, and much more!", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 699, "guid": "b8812b82-2a40-51f7-8e92-5cc9cb030ccf", "logo": "", "date": "2023-09-08T09:50:00+01:00", "start": "09:50", "duration": "01:00", "room": "Auditorium", "slug": "pycon-pt-2023-699-breaking-bias-pywomen-0-erroralert", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/8YANQ3/", "title": "Breaking Bias: PyWomen = 0 #ErrorAlert", "subtitle": "", "track": null, "type": "Keynote", "language": "en", "abstract": "In this keynote we are going to talk about how unconscious bias can impact on business and real world IT products and learn the importance of understanding the inclusion of diverse teams.", "description": "In this keynote we are going to talk about how unconscious bias can impact on business and real world IT products and learn the importance of understanding the inclusion of diverse teams.", "recording_license": "", "do_not_record": false, "persons": [{"id": 680, "code": "ZMKNKH", "public_name": "Cláudia Mendes", "biography": "As the Global Director for Portuguese-Speaking Countries at the international NGO Women in Tech®, she is a passionate advocate for gender equality in the IT industry. With a strong background in Project Management and serving as a Diversity Ambassador at Siemens Portugal, she strives to promote inclusivity and innovation in the workplace.\r\nShe holds a Master's degree in Computer Engineering from the Faculty of Sciences and Technology at the University of Coimbra. Additionally, she contributes her expertise as a member of the Advisory Board at CHRLY, a Corporate Startup of Fujitsu Portugal and Advisory Board at Leading Tech, Líder Magazine.\r\nHer commitment to fostering diverse and thriving tech ecosystems extends to mentoring aspiring female entrepreneurs in Lisbon.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 626, "guid": "143f390a-590e-516c-b09b-2fe01d0e8be3", "logo": "", "date": "2023-09-08T11:20:00+01:00", "start": "11:20", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-626-living-and-breathing-backwards-compatible-changes", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/KTDU7M/", "title": "Living and breathing backwards compatible changes", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "From the team behind AWS Lambda Powertools for Python, we will explore trade-offs in API design and UX when your project is used by thousands of customers in production.", "description": "Breaking changes can have a significant impact on the developer experience and the adoption of an open source project. How can we strike the right balance between developing our software and keeping our users happy and engaged with our projects?\r\n\r\nAs maintainers of AWS Lambda Powertools for Python, we embrace the exciting challenges that come with developing a widely adopted project, serving thousands of customers worldwide. Throughout our journey, we've discovered firsthand the immense complexities of managing software changes while engaging with a thriving community. Today, we stand proud, having unlocked the secrets to fostering an interactive and dynamic community around a rapidly evolving project. In this captivating presentation, we eagerly share the invaluable lessons we've learned along the way. As an attendee, you will discover insights that will benefit both consumers and maintainers of open source projects alike.", "recording_license": "", "do_not_record": false, "persons": [{"id": 681, "code": "VADXKU", "public_name": "Leandro Damascena", "biography": null, "answers": []}, {"id": 682, "code": "S9HYFG", "public_name": "Henrique Graça", "biography": null, "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 670, "guid": "16cbc679-bcc1-50ec-a504-d2d8c88a2e58", "logo": "", "date": "2023-09-08T11:55:00+01:00", "start": "11:55", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-670-practical-guide-to-database-locks-with-django", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/A7TPJU/", "title": "Practical Guide to Database Locks with Django", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Race conditions? No problem! Dive into the world of database locks with Django and gain hands-on knowledge on how to eliminate race conditions, maintain order, and boost your application's performance.", "description": "Imagine organizing and managing a party with a Django project, where everyone wants to be part of the action. But how can you prevent chaos and ensure order amid the commotion? That's where database locks swoop in like party bouncers, maintaining a queue at the door!\r\n\r\n- Introduction to Database Locks (5 minutes)\r\nOverview of database locks and their importance in concurrent environments\r\n\r\n- Types of Database Locks (5 minutes)\r\nShared locks vs. exclusive locks\r\nRow-level locks vs. table-level locks\r\n\r\n- Locking Strategies in Django (10 minutes)\r\nDatabase-level vs. application-level locking\r\nUtilizing Django's built-in locking mechanisms (select_for_update(), transaction.atomic())\r\n\r\n- Practical Use Cases (10 minutes)\r\nHandling concurrent requests and preventing race conditions\r\nEnsuring transactional integrity with locks\r\nImplementing optimistic locking to avoid conflicts\r\n\r\n- Q&A", "recording_license": "", "do_not_record": false, "persons": [{"id": 663, "code": "BWRC8B", "public_name": "Efe Öge", "biography": "I’ve been tinkering with web projects since my childhood, and that curiosity eventually led me to pursue a career in software development. With over seven years of professional experience in the industry, I’ve had the opportunity to work on a diverse range of projects and technologies.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 665, "guid": "4939032d-a9c2-5cf9-8bd1-ff8921b90e7d", "logo": "", "date": "2023-09-08T12:30:00+01:00", "start": "12:30", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-665--python-in-qiskit-enviroments-for-quantum-computing-", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/U3WE7H/", "title": "\"PYTHON IN QISKIT ENVIROMENTS FOR QUANTUM COMPUTING\"", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Python's presence in Qiskit environments for quantum computing is vital for several reasons. Its simplicity, extensive libraries, and integration with scientific computing tools make it an ideal language for expressing quantum algorithms and designing quantum circuits. Python's versatility allows researchers to combine quantum computing with machine learning techniques, opening new possibilities for advancements in the field. Furthermore, Python's emphasis on readability and the support of a vibrant community fosters collaboration and knowledge-sharing, propelling the growth and adoption of quantum computing.", "description": "Python plays a crucial role in the Qiskit environment for quantum computing, providing a powerful and versatile programming language that enables researchers and developers to harness the full potential of quantum technologies. Qiskit, an open-source quantum computing framework developed by IBM, utilizes Python as its primary language for designing, simulating, and executing quantum circuits. Python's simplicity and readability make it an ideal choice for both beginners and experts in the field, allowing them to easily express complex quantum algorithms and workflows. Its extensive libraries and frameworks further enhance the capabilities of Qiskit, enabling seamless integration with classical computing and data analysis tools.\r\n\r\nThe integration of Python in Qiskit environments brings numerous advantages to quantum computing. Python's extensive ecosystem of scientific computing libraries, such as NumPy and SciPy, provides essential functionalities for mathematical operations, linear algebra, and optimization algorithms, all of which are vital in quantum computing. These libraries enable efficient manipulation of quantum states and gates, facilitating the development and testing of quantum algorithms. Moreover, Python's versatility allows researchers to leverage machine learning and artificial intelligence techniques to enhance quantum algorithms and optimize quantum circuit designs, opening new avenues for discovery and advancement in the field.\r\n\r\nAnother key aspect of Python's importance in Qiskit environments is its emphasis on code readability and community support. Python's clean syntax and well-documented libraries make it easier for researchers and developers to collaborate, share code, and build upon each other's work. The vibrant Python community provides a wealth of resources, tutorials, and forums where quantum enthusiasts can exchange ideas, seek guidance, and foster innovation. This collaborative environment accelerates the growth and adoption of quantum computing, enabling researchers to tackle complex problems and explore the potential applications of quantum technologies across various domains.", "recording_license": "", "do_not_record": false, "persons": [{"id": 661, "code": "FQW9YE", "public_name": "Francisco Lavrador Pires", "biography": "Licenciatura em Engenharia Eletrotécnica - Ramo de Informática\r\nProjetos de Engenharia de Software e Telecomunicações\r\nPós Graduação em Direito da Comunicação\r\nPós Graduação em Sistemas de Gestão da Segurança da Informação\r\nEngenheiro de Redes de Telecomunicações em Fibra Ótica CTT-Telecomunicações\r\nGestor de Projetos - Portugal Telecom - Coimbra\r\nGestor de Grandes Clientes - Telecom Portugal (Coimbra - Lisboa )\r\nInvestigador e “Strategic Thinker”- Centro de Estudos de Telecomunicações - Aveiro\r\nGestor de Projetos Europeus - Internet and Public Operators - PT Inovação\r\nDiretor de Inovação Empresarial - Associação Comercial e Industrial de Coimbra\r\nVogal do Conselho de Administração - Associação Coimbra Região Digital\r\nDiretor Executivo da Associação Coimbra Região Digital\r\nConsultor de Sistemas de Engenharia de Software e Telecomunicações\r\nDocente de Pós Graduação - Privacidade e Proteção de Dados - ISCAC - Coimbra Business School\r\nDocente Mestrado - Gestão de Projetos de Sistemas de Informação - ISEC\r\nAuditor ISO 27001 - Sistemas de Gestão de Segurança da Informação\r\nDPO - EPD : Encarregado de Proteção de Dados - Implementação RGPD\r\nOrientador de Estágios DEIS - ISEC (Blockchain Engineering e Smart Contracts)\r\nSenior Engineering Advisor - ISEC - Coimbra Engineering Academy\r\nLecturer and Trainer em Inteligência Artificial e Computação Quântica\r\nGestor e Líder de Projectos em Blockchain / DLT\r\nGestor e Lider de Projetos de Inteligência Artificial\r\nGestor e Lider de Projetos de Computação Quântica", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 669, "guid": "745e29b5-71c7-502c-8fcd-d2f8f0c0ac51", "logo": "", "date": "2023-09-08T14:05:00+01:00", "start": "14:05", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-669-i-know-polars-is-fast-but-my-data-pipelines-are-written-in-pandas-", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/HB9X8G/", "title": "I know Polars is fast, but my data pipelines are written in pandas!", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "We all know it by now: Polars is blazingly fast™️. Yet my pipelines are all written in pandas, and it will just take too much time to rewrite them in Polars... won't it? Turns out, it takes less than thirty minutes to tame this new arctic beast!", "description": "How long do you think it would take to rewrite your data pipelines from pandas to Polars? It turns out, less than you would expect! Of course, \"if it ain't broke, don't fix it\" - yet there are some fruits that are just hanging too low for you to ignore.\r\n\r\nStarting from I/O, to (almost) zero-copy conversion from pandas to Polars, you will quickly realise how cheap and convenient it is to swap some bits of your pipelines from pandas to Polars. Though pandas' API is incredibly good, you will soon realise how Polars took it to the next level and made it much more powerful, expressive and intuitive.\r\n\r\nCome for the speed, stay for the syntax!\r\n\r\n📍 Keynote outline\r\n\r\n- Polars: the cheapest ways to reap its benefits.\r\n- Blazingly fast I/O with `LazyDataFrame`s.\r\n- Powerful column selection with the new `selectors` module.\r\n- `df.filter()`: no more \"setting a view vs a copy\" warnings.\r\n- How to write expressive `groupby` statements and window functions.\r\n- Nested data? Not a problem!\r\n- Work with datasets larger than memory.\r\n- Don't like the syntax? Just use SQL - it even works from the CLI!", "recording_license": "", "do_not_record": false, "persons": [{"id": 664, "code": "W9ZLUD", "public_name": "Luca Baggi", "biography": "👋 Hello there! I am a Machine Learning Engineer at Futura, an edtech startup, and I have been giving lectures in machine learning at the University of Milan for a couple of years. I am also an organiser of Python Milano, Milan's local Python meetup. I love writing sound, well-documented code, time-series forecasting and dataframe libraries.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 644, "guid": "c496e3d2-cd9f-5e27-98bc-0eac50a394a6", "logo": "", "date": "2023-09-08T14:40:00+01:00", "start": "14:40", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-644-faster-python-with-friends", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/P9GAJB/", "title": "Faster Python with friends", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Python's flexible and intuitive syntax enables developers to quickly build applications. But on the other hand, it may be slow during runtime. Luckily, there are different ways we can speed up a Python program. In this talk, we'll explore different alternatives to make Python programs faster.", "description": "## About the talk\r\n\r\nPython's \"speed problem\" is not a new issue, but there are different ways to speed a Python program up. In recent years, Python 3.11 was released and popularized as the [\"faster Python\"](https://docs.python.org/3/whatsnew/3.11.html#summary-release-highlights) and [Mojo](https://www.modular.com/mojo) programming language was recently announced, advertised as having \"usability of Python with the performance of C\". Going back further, we see languages such as Cython, Just In Time (JIT) compilers and bindings.\r\n\r\nIn this talk, we'll go over the different approaches to increasing the speed of a Python application. We'll briefly explain how they work, compare the performance through a simple use case, and look at the limitations, tooling, trade-offs, and ease of use.\r\n\r\n## Outline\r\n\r\n- Introduction and setup (3min)\r\n- Baseline - Python 3.9 (3min)\r\n- Alternatives (20min):\r\n  - Python 3.11\r\n  - Cython & Mypyc\r\n  - Pypy3\r\n  - PyO3\r\n  - Mojo\r\n- Recap and takeaways (4min)", "recording_license": "", "do_not_record": false, "persons": [{"id": 307, "code": "YN9PA8", "public_name": "Murilo Cunha", "biography": "Murilo is a tech lead AI at Dataroots. He takes a pragmatic approach aiming to make AI both impactful and accessible. To that end, Murilo has an emphasis on MLOps when building ML systems. He's passionate about open-source, programming, and knowledge sharing.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 540, "guid": "c0008e5a-b230-54d3-8b05-e69d4da104e4", "logo": "", "date": "2023-09-08T15:15:00+01:00", "start": "15:15", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-540-comprehending-comprehensions", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/FMZMGP/", "title": "Comprehending Comprehensions", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Discover the immense potential of Python's list comprehensions, dictionary comprehensions, set comprehensions, and generator expressions, as we present them as an idiom that focuses on data transformations.\r\n\r\nUsing real-world examples, we'll demonstrate how these tools can streamline data manipulation and transformation tasks while enhancing code readability. We'll also provide insights on best practices and use cases to maximize their effectiveness.\r\n\r\nBy the end of this talk, you will be equipped to confidently harness the full potential of comprehensions and generator expressions, empowering you to create more expressive and elegant Python code. Join us on this exciting journey and level up your Python programming!", "description": "We will start by going over the full anatomy of a list comprehension, both by motivating the need for such a construct and by comparison to the equivalent for loop.\r\n\r\nThen, we will take a look at some real-world examples of good list comprehensions, pointing out the qualities that make them elegant and expressive, which we will present as best practices.\r\n\r\nFinally, we will use our understanding of list comprehensions to extend the syntax to dictionary and set comprehensions, as well as generator expressions.", "recording_license": "", "do_not_record": false, "persons": [{"id": 317, "code": "D33C79", "public_name": "Rodrigo Girão Serrão", "biography": "Rodrigo has always been fascinated by problem solving and that is why he picked up programming – so that he could solve more problems. He also loves sharing knowledge, and that is why he spends so much time writing articles in his blog [mathspp.com/blog](https://mathspp.com/blog), writing on Twitter [@mathsppblog](https://twitter.com/mathsppblog), and giving workshops and courses. You can also find his past talks on [github.com/mathspp/talks](https://github.com/mathspp/talks).\r\n\r\nHis main areas of scientific interest are mathematics (numerical analysis in particular) and programming in general (with a preference for the Python and APL languages), but Rodrigo also enjoys reading fantasy books, watching silly comedy movies and eating chocolate.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 700, "guid": "2045d4db-d8d8-5bc9-8dbc-a5f0dc3b6bf7", "logo": "", "date": "2023-09-08T16:20:00+01:00", "start": "16:20", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-700-building-advanced-back-office-interfaces-using-django-htmx", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/SHF7YM/", "title": "Building advanced back-office interfaces using Django & HTMX", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Explore a pragmatic approach to enhancing Django's back-office interfaces. Delve into the practical integration of lightweight frameworks like HTMX and AlpineJS to introduce interactivity with minimal JavaScript. This talk focuses on custom generic class-based views, offering insights into CRUD operations, formsets, and advanced techniques for managing Django models. Join me for a comprehensive overview of these techniques, from read-only forms to patching HTMX into the Django Admin, as we redefine Django development practices.", "description": "Modern applications often necessitate a back-office interface to facilitate administrative tasks. While Django's generic class-based views are valuable for fundamental CRUD operations, they may fall short when it comes to meeting specific UI/UX requirements.\r\nThese views, while reliable for CRUD tasks, tend to lack interactivity due to the absence of JavaScript and their tendency to refresh the entire page upon use.\r\nTraditionally, the go-to solution has been to construct the interface with a frontend framework, but this approach can be resource-intensive and time-consuming.\r\nNow, with the emergence of lightweight frameworks like HTMX and AlpineJS, it's possible to introduce interactivity into your application with minimal JavaScript or reliance on dedicated frontend frameworks. This approach allows you to maintain the interface layout within Django templates and keep the application state on the server.\r\nThis presentation explores various use cases for common development patterns in CRUD interfaces and the management of extensive Django models. It places a special emphasis on custom generic class-based views and how to seamlessly integrate them with HTMX to deliver a frontend-like user experience.\r\n\r\nKey Topics Covered:\r\n* Leveraging Django's generic class-based views for CRUD functionality.\r\n* Evaluating Formsets and alternative options.\r\n* Comparing HTMX & HATEOAS to Frontend & REST approaches.\r\n* Implementing CRUD operations within a Single View: CreateUpdateDeleteView.\r\n* Achieving inline object manipulation without relying on formsets.\r\n* Handling complex models with multi-step processes using WizardView.\r\n* Presenting form data in read-only mode via the form layout with ReadOnlyFormView.\r\n* Delving into advanced, out-of-scope examples, including Sortable UIs and WebComponents.\r\n* Exploring the possibilities of integrating HTMX into the Django Admin to transform it into a frontend-like experience.\r\n\r\nThis presentation aims to shed light on how to enhance your Django-based applications with a more interactive and efficient administrative interface, all while minimizing the need for extensive frontend development.", "recording_license": "", "do_not_record": false, "persons": [{"id": 684, "code": "A3HDM9", "public_name": "Lucas Pires", "biography": "Originally from Porto, Portugal, and holding an Msc. in Networks & Computer Engineering from the University of Porto, I've passionately pursued a career as a versatile freelancer, specializing in the development and maintenance of websites, back-end systems, and mobile applications for a diverse range of small companies. My skill set encompasses a variety of technologies, including PHP, NodeJS, Flutter, Ionic, HTMX, and Django.\r\nCurrently, I am fully committed to my role at Evolutio, where I lead the development of comprehensive applications for an array of clients from various sectors. My projects have ranged from creating housing market statistics platforms to crafting CMS applications for housing news and events management, utilizing a combination of Django, SvelteKit, and HTMX.\r\nIn my spare time, I enjoy sharing my knowledge through Full-stack Web Development courses, primarily aimed at university students. I am continually expanding my knowledge base, diving deep into topics such as DevOps tools and exploring the ever-evolving landscape of frontend frameworks, with a particular focus on SvelteKit.\r\nWhen I'm not immersed in code, you can find me enjoying my other passions, including retro video games, fine-tuning my music mixing skills, and exploring the wonders of our world through travel.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 549, "guid": "06dc913d-f6b9-50a1-a5f3-68a5d2b06aa9", "logo": "", "date": "2023-09-08T16:55:00+01:00", "start": "16:55", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-549-getting-started-with-modern-python-packaging", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/UVAQW3/", "title": "Getting started with (modern) Python packaging", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Let's make sense of modern Python packaging tooling.", "description": "Python packaging has seen a lot of change recently. In the last few years lots of different tools showed up and getting started with Python packaging can be confusing. In this talk, I will introduce you to the available tooling, help you make sense of it, and guide you through the process of creating and releasing a Python package.", "recording_license": "", "do_not_record": false, "persons": [{"id": 583, "code": "NXMEER", "public_name": "Filipe Laíns", "biography": "Filipe has been involved in Python packaging for a while. They are the author of pypa/build, a PyPA member, and a Python core developer. On their free time they are interested in electro-metrology, nuclear physics, and they are (foolishly) trying to make semiconductors at home.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 546, "guid": "d870d8b3-f617-5245-bf9e-82d6ddb4f618", "logo": "/media/pycon-pt-2023/submissions/D7X3HN/dymmond_1DTUE0D.png", "date": "2023-09-08T17:30:00+01:00", "start": "17:30", "duration": "00:35", "room": "Auditorium", "slug": "pycon-pt-2023-546-esmerald-and-saffier-complex-python-made-it-easy-with-async", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/D7X3HN/", "title": "Esmerald and Saffier - Complex Python made it easy with async", "subtitle": "", "track": null, "type": "Talk", "language": "en", "abstract": "Python in the context of data for python developers, non python engineers and businesses using Esmerald and Saffier with the power of async python.", "description": "There are great frameworks out there like FastAPI, Flama, Flask, Django... All of them solving majority of the current day-to-day problems of 99% of the applications but leaving the 1% that is usually around structure and design/business without to much to do.\r\n\r\nEsmerald got the inspiration from those great frameworks out there and was built with all the known amazing features but with business in mind as well.\r\n\r\nSaffier leverages the power of Pydantic for its fields while offering a friendly, familiar and easy to use interface.\r\n\r\nThis ORM was designed to be flexible and compatible with pretty much every ASGI framework, like Esmerald, Starlette, FastAPI, Sanic, Quart... With simple pluggable design thanks to its origins.\r\n\r\nFor this 30 minute session it is aimed to showcase:\r\n\r\nA robust and organized python application with Esmerald (https://esmerald.dev) and Saffier (https://saffier.tarsild.io) while integrating the native JWT authentication with a clean API design using Esmerald native routing system and leveraging Esmerald native validations using pydantic with python typing system.", "recording_license": "", "do_not_record": false, "persons": [{"id": 580, "code": "7NUXVL", "public_name": "Tiago Silva", "biography": "I'm passionate software engineer and entrepreneur.\r\n\r\nCreator of Esmerald and many other opensource projects.\r\n\r\nWeb 3.0, Cloud, Data Analytics, Blockchain and all in between are the areas that I can help you.\r\n\r\nI created Esmerald, Saffier, Asyncz, Django Tenants URL, Django Messages DRF and a bunch of other opensource tools being widely used by a lot of companies and people.\r\n\r\nI do a lot of Open Source projects and code to give back to the community what I've learnt and that demands even more time than the one I currently have and all my free time goes to the free and open-source software I build.\r\n\r\nBy checking my public repositories you will see that I've done a lot of the heavy lifting for a lot of frameworks (Django, Flask, FastAPI, Angular, React, React for Blockchain...) that will save a lot of time and configurations, it will save months to be very honest to a lot of developers (structure, configurations...), I hope you enjoy using them as I do enjoy maintaining them", "answers": []}, {"id": 677, "code": "AW3MQV", "public_name": "Pedro Correia", "biography": null, "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 697, "guid": "132ceff0-1c99-523d-be2b-7d0d66c0f259", "logo": "", "date": "2023-09-08T18:05:00+01:00", "start": "18:05", "duration": "00:30", "room": "Auditorium", "slug": "pycon-pt-2023-697-lightning-talks", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/BLPSVZ/", "title": "Lightning Talks", "subtitle": "", "track": null, "type": "Other", "language": "en", "abstract": "Lightning Talks", "description": "Lightning Talks", "recording_license": "", "do_not_record": false, "persons": [], "links": [], "attachments": [], "answers": []}]}}, {"index": 3, "date": "2023-09-09", "day_start": "2023-09-09T04:00:00+01:00", "day_end": "2023-09-10T03:59:00+01:00", "rooms": {"Workshop I": [{"id": 625, "guid": "8fd2110e-c9bd-57cf-9768-def2e7aa5ad8", "logo": "", "date": "2023-09-09T09:00:00+01:00", "start": "09:00", "duration": "02:00", "room": "Workshop I", "slug": "pycon-pt-2023-625-beyond-the-basics-data-visualization-in-python", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/STX8K3/", "title": "Beyond the Basics: Data Visualization in Python", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "The human brain excels at finding patterns in visual representations, which is why data visualizations are essential to any analysis. Done right, they bridge the gap between those analyzing the data and those consuming the analysis. However, learning to create impactful, aesthetically-pleasing visualizations can often be challenging. This session will equip you with the skills to make customized visualizations using Python.", "description": "#### Section 1: Getting Started With Matplotlib\r\nWhile there are many plotting libraries to choose from, the prolific Matplotlib library is always a great place to start. Since various Python data science libraries utilize Matplotlib under the hood, familiarity with Matplotlib itself gives you the flexibility to fine tune the resulting visualizations (e.g., add annotations, animate, etc.). Moving beyond the default options, we will explore how to customize various aspects of our visualizations. Afterward, you will be able to generate plots using the Matplotlib API directly, as well as customize the plots that other libraries create for you.\r\n\r\n#### Section 2: Moving Beyond Static Visualizations\r\nWhile static visualizations are limited in how much information they can show, animations make it possible for our visualizations to tell a story through movement of the plot components (e.g., bars, points, lines), which can encode another dimension of the data. In this section, we will focus on creating animated visualizations before moving on to create interactive visualizations in the next section.\r\n\r\n#### Section 3: Building Interactive Visualizations for Data Exploration\r\nWhen exploring our data, interactive visualizations can provide the most value. Without having to create multiple iterations of the same plot, we can use mouse actions (e.g., click, hover, zoom, etc.) to explore different aspects and subsets of the data. In this section, we will learn how to use HoloViz to create interactive visualizations for exploring our data utilizing the Bokeh backend.\r\n\r\n---\r\n\r\n#### Target Audience\r\nThis tutorial is for anyone with basic knowledge of Python and an interest in learning how to analyze data in Python. We will be working with Jupyter Notebooks, so attendees should familiarize themselves with the interface (i.e., know how to run/edit a cell) beforehand.\r\n\r\n#### Environment Setup\r\nPlease set up your environments ahead of time by following the instructions [here](https://github.com/stefmolin/python-data-viz-workshop#setup-instructions).", "recording_license": "", "do_not_record": false, "persons": [{"id": 402, "code": "9NHRV8", "public_name": "Stefanie Molin", "biography": "Stefanie Molin is a software engineer and data scientist at Bloomberg in New York City, where she tackles tough problems in information security, particularly those revolving around data wrangling/visualization, building tools for gathering data, and knowledge sharing. She is also the author of [Hands-On Data Analysis with Pandas](https://www.amazon.com/Hands-Data-Analysis-Pandas-visualization/dp/1800563450), which is currently in its second edition and has been translated into Korean. She holds a bachelor’s of science degree in operations research from Columbia University's Fu Foundation School of Engineering and Applied Science, as well as a master’s degree in computer science, with a specialization in machine learning, from Georgia Tech. In her free time, she enjoys traveling the world, inventing new recipes, and learning new languages spoken among both people and computers.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 558, "guid": "39e428f7-fa21-5d23-bac6-5266c89eae0a", "logo": "/media/pycon-pt-2023/submissions/KDT9ZL/Micropython-350x376_VArIYFd.jpg", "date": "2023-09-09T11:30:00+01:00", "start": "11:30", "duration": "02:00", "room": "Workshop I", "slug": "pycon-pt-2023-558-micropython-and-time-series-analysis-forecasting-and-trend-analysis", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/KDT9ZL/", "title": "MicroPython and time series analysis: Forecasting and trend analysis", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "The workshop on \"MicroPython and time series analysis: Forecasting and trend analysis\" is designed to help attendees learn how to perform time series analysis, forecasting, and trend analysis using MicroPython. This workshop is ideal for anyone interested in learning how to analyze data collected over time, and how to use MicroPython to implement these analyses on microcontrollers.", "description": "The workshop on \"MicroPython and time series analysis: Forecasting and trend analysis\" is designed to help attendees learn how to perform time series analysis, forecasting, and trend analysis using MicroPython. This workshop is ideal for anyone interested in learning how to analyze data collected over time, and how to use MicroPython to implement these analyses on microcontrollers.\r\n\r\nThe workshop will begin with an introduction to time series analysis, which is the study of data points collected over time. I will explore the different types of time series data, including univariate and multivariate time series, and the common methods used to analyze this data, such as trend analysis and forecasting.\r\n\r\nNext, I will discuss the advantages of using MicroPython for time series analysis on microcontrollers. Attendees will learn how to use MicroPython to read time series data from sensors and how to preprocess this data for analysis. They will also learn how to implement different types of time series analysis, such as trend analysis and forecasting, using MicroPython.\r\n\r\nI will then showcase some practical examples of time series analysis,  weather forecasting and demonstrate how to implement these using MicroPython. Attendees will have the opportunity to work on hands-on exercises and build their own time series analysis models using MicroPython.\r\n\r\nIn the second half of the workshop, I will focus on deploying and running the time series analysis models on microcontrollers. Attendees will learn how to optimize the models for microcontrollers and how to deploy them using MicroPython. I will also discuss the challenges of working with limited computational resources and how to overcome them.\r\n\r\nBy the end of the workshop, attendees will have gained practical experience in performing time series analysis using MicroPython. They will be equipped with the knowledge and tools needed to develop their own time series analysis models using MicroPython and will have a solid understanding of the benefits and limitations of using MicroPython for time series analysis on microcontrollers.\r\n\r\nThis workshop is suitable for anyone interested in time series analysis, microcontrollers, and MicroPython, from beginners to experienced practitioners. Attendees are expected to have a basic understanding of Python programming and data analysis, but no prior experience with time series analysis or microcontrollers is necessary.", "recording_license": "", "do_not_record": false, "persons": [{"id": 584, "code": "S9CE7X", "public_name": "Olaniyan Adewale", "biography": "Olaniyan Adewale Hafeez is a trained civil engineer but chose IT as a career and built his reputation at home and abroad. He was a computer technician and network administrator at the beginning of his IT career until he switched to programming. He has over ten years of experience with Python & PHP. Adewale has developed various applications in Python for both private and government organizations. He has wide knowledge in HTML5, JavaScript, JQuery, PHP, Python, Magneto, MySQL, Twitter, Bootstraps, Scratch, Codeigniter, Python, Flask, Django Framework, Vuejs, Dart and Flutter. He is a Full-Stack Developer, Data Scientist, and Embedded Engineer.\r\nHe has trained thousands of students in the Open Source field. He spent most of his time promoting Open Source technologies. He has organized free Open-Source Seminars for different organizations and communities like the Nigeria Computer Society of Nigeria, Universities and the like.\r\nHe is the founder of Couone Technology Limited, an IT consultancy firm. He also founded TechWorld Academy, Nigeriware Enterprise and Techware Innovation Bahrain. He teaches kids aged 8 to 16 robotics, cartooning and animation.\r\nCurrently, he is a full entrepreneur under the Technical Incubation Centre of the Federal Ministry of Science and Technology. He also provides consultancy to Ogun TechHub under his company Couone Technology Limited. Additionally, he runs another innovation called RobotKkraft Africa, which provides embedded systems, IoT and robotics bootcamps for youth, graduates, and professionals.\r\nBesides these, he uses his spare time to develop embedded devices. This has become one of his passions and hobbies by making use of Arduino, esp8266 and other Internet of Things boards.\r\nSome of his works include Remote Liquid Measurement and Management System (IoT), Digital Metre Security, e-Post Paid Metre (Web & Mobile App) www.halaljob.com.ng, NigeriaWare, Egba Coding Boot-Camp, eSchoolConnect, myzawaj.com.ng and many others.", "answers": []}, {"id": 585, "code": "MSJHMM", "public_name": "Sulaiman Adisa Adigun", "biography": null, "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 599, "guid": "7efe11f1-1d01-5f37-a457-c38aa9b07c0a", "logo": "/media/pycon-pt-2023/submissions/M88V9R/session_img_6FY3hXG.png", "date": "2023-09-09T14:30:00+01:00", "start": "14:30", "duration": "02:00", "room": "Workshop I", "slug": "pycon-pt-2023-599-from-websites-to-datasets-unleashing-the-power-of-data-harvesting-with-python", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/M88V9R/", "title": "From WebSites to Datasets: Unleashing the Power of Data Harvesting with Python", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "Learn how to develop multiparadigm web scrapers and crawlers leveraging an async model. Discover how to extract valuable information from websites using Python's environment and powerful tools. Master the art of collecting data at scale. Join this exhilarating journey of web exploration.", "description": "We will enbark in a captivating journey of extracting and parsing data from the vast online universe. I'll be talking a bit about web app reverse engineering for understanding a bit of how the web is modelled and how we think of it when building scrapers. Present some open source libraries that will help us get to our solution. Will introduce some OOP design concepts when building our Scraper and Crawler and how we can publish our first open source PyPi python library. Then finalise with some insights about customisation and efficiency in terms of execution speed and memory.", "recording_license": "", "do_not_record": false, "persons": [{"id": 608, "code": "DZDVGN", "public_name": "Gonçalo Marques", "biography": "A developer with a big interest on how the web works and about the processes of developing utility tools around it, be it extensions or backends for those.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 650, "guid": "558545a6-b040-5338-869d-60c9a03ec2d2", "logo": "", "date": "2023-09-09T17:00:00+01:00", "start": "17:00", "duration": "02:00", "room": "Workshop I", "slug": "pycon-pt-2023-650-boosting-up-your-tests-property-based-testing-workshop", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/YDTNVL/", "title": "Boosting up your tests: property-based testing workshop", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "Have you introduced bugs to your project when refactoring or making a “small” change to your code? Do you want to make your code base bulletproof? Learn how and when to write property-based tests, with little effort but significant benefits.", "description": "One of the main premises when writing production-ready code is to make it as reliable as possible, therefore we can implement new features, refactor and make changes to our code with confidence. One tool that helps us achieve this goal is testing. \r\n\r\nWhat is the first thing that comes to mind when talking about testing? Probably the test pyramid: unit, integrations, and E2E tests, and often that is enough when implementing tests in our codebase. But, what if you could boost all of them with little effort and make your codebase even more reliable?\r\nIt's almost impossible to capture all of the edge cases that can occur in our application and reflect those cases as tests. In this workshop, we’ll use the Hypothesis Python testing library to help us generate random data and run multiple test cases with arbitrary inputs in order to increase our trust and coverage in our test suite. So we can break… sorry, refactor our code with confidence :).\r\nAfter this workshop, you’ll be able to start including property-based tests in your project, and you’ll also be able to identify the main cases where property testing makes sense (Spoiler alert! Not all tests should be implemented with a property-based approach)", "recording_license": "", "do_not_record": false, "persons": [{"id": 332, "code": "BK7CRH", "public_name": "Felix Mino", "biography": "I’m Felix Miño, software developer at Stack Builders, two-time PyCon Latam speaker, one-time at Pycon Colombia, and one-time speaker at DjangoCon Europe. I have more than 4 years of experience in the software industry and have had the chance to work on different projects with various programming languages such as Python, Haskell, and TypeScript. Since 2022, I lead the “Quito Lambda” Meetup community in Ecuador, a space that aims to share topics mainly related to the functional programming paradigm and its usage. I’m eager to share what I’ve learned over these years with a broader software community. During my free time, I enjoy cooking and discovering the world through its flavors. Lately, I’ve been into running and trailing.", "answers": []}], "links": [], "attachments": [], "answers": []}], "Workshop II": [{"id": 553, "guid": "b68750e8-91ea-5fbb-a75c-37a58a69ea4c", "logo": "/media/pycon-pt-2023/submissions/33WFNT/a_laptop_screen_with_Django_interface_using_REPORTLab_t_HZQQBtT.jpg", "date": "2023-09-09T09:00:00+01:00", "start": "09:00", "duration": "02:00", "room": "Workshop II", "slug": "pycon-pt-2023-553-django-and-reportlab-create-pdf-like-a-boss-", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/33WFNT/", "title": "Django and ReportLab: create PDF Like A Boss .", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "PDF document guarantees 100% delivery of content to the customers as planned.\r\nThe workshop shows how to use the REPORTLab library to create PDF generator, based on Django Models and Templates to allow complex document layout for auto-generated catalogs or reports in PDF format.", "description": "In this talk, I discuss my experience of developing the PDF generator last 8 years:\r\n\r\n1. The current state of python PDF generators. \r\nPDF ensures the document's appearance remains consistent across different devices and platforms. When working with large amounts of data it is easy to automate data conversion using the Python PDF generator.\r\n\r\n2.Why we choose a ReportLab for our PDF generator.\r\nIt depends on complexity of the document in the end.\r\n- We need table of contents, grouping of information, term tables.\r\n- We use complex data visualization layouts.\r\n- We use media and Special fonts in the document.\r\n- We want to mix multiple documents into one document.\r\nThis all offers only ReportLab package.\r\n_________________________________________________\r\nAfter intro:\r\n_________________________________________________\r\n\r\n3. Create some Django Models to setup Generator Possibilities.\r\n\r\n4. Create some Templates for Objects\r\n\r\n5. Render to PDF with ReportLab and \"Platipus\"\r\n\r\n6. The owerview a result and discuss the potential obstacles in using PDF generators for business and provides tips to avoid them.\r\n\r\n7. Q&A", "recording_license": "", "do_not_record": false, "persons": [{"id": 285, "code": "JUGPGE", "public_name": "Maxim Danilov", "biography": "25 Years in software development, 9 years with Django.\r\nPython/Django Mentor, Tech Coach, Author and Speaker.\r\n\r\nProgramming languages stack: RISC Assembly Language, C, ASP, VB/VBA, PHP, HTML/CSS, VueJS/NuxtJS, Python\r\nI live in Austria in Tirol. I am also Alpine Ski and x-cross-country Instructor.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 636, "guid": "ae95027e-b563-54a6-a8b6-7aab6a9a013a", "logo": "", "date": "2023-09-09T11:30:00+01:00", "start": "11:30", "duration": "02:00", "room": "Workshop II", "slug": "pycon-pt-2023-636-learn-flask-the-hard-way-introduce-architecture-patterns", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/LA7CBV/", "title": "Learn Flask the hard way: Introduce Architecture Patterns", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "Level up your Flask skills in this workshop! Learn Flask the hard way by diving into architectural patterns. Discover how to build scalable and maintainable applications using Repository, Unit of Work, and Use Cases. Don't miss this opportunity to become a Flask pro!", "description": "Flask is a popular and flexible web framework for Python, but building scalable and maintainable Flask applications can be challenging without a solid understanding of architecture patterns. \r\nThis workshop aims to provide participants with a detailed explanation of applying architecture patterns to Flask projects. By exploring various design principles and best practices, attendees will learn how to structure their Flask applications for improved scalability, modularity, and maintainability.\r\n\r\nFocusing on the Repository, Unit of Work, and Use Cases patterns, attendees will gain experience in applying these patterns to enhance code organization, maintainability, and testability. All these layers are wired together using Dependency Injection, which is yet another powerful tool to use in your applications.\r\n\r\nThe application we are going to build is stored in: https://github.com/ShahriyarR/hexagonal-flask-blog-tutorial \r\n\r\nWe are going to completely rewrite the official Blog application described in [Flask documentation](https://flask.palletsprojects.com/en/2.3.x/tutorial/blog/) by applying architecture patterns.\r\n\r\nAll abstraction layers are covered by unit and integration tests, which will give the attendees a detailed view of why it is important to structure the application using architecture patterns.", "recording_license": "", "do_not_record": false, "persons": [{"id": 637, "code": "ZUTZVF", "public_name": "Shahriyar Rzayev", "biography": "Senior Software Engineer @ Nord Security. Moving forward on Clean Code and Clean Architecture. Previous accomplishments include contributing to open source, providing technical direction, and sharing knowledge about Clean Code and Architectural patterns. An empathetic team player and mentor.\r\nAzerbaijan Python Group Leader. Former QA Engineer and Bug Hunter.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 698, "guid": "98ec8c32-e374-5481-8bc2-c7b1d2da73ef", "logo": "", "date": "2023-09-09T14:30:00+01:00", "start": "14:30", "duration": "02:00", "room": "Workshop II", "slug": "pycon-pt-2023-698-data-storytelling-using-python", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/DX3MTL/", "title": "Data Storytelling using Python", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "In this captivating workshop, participants will embark on an exciting journey to explore the art of data storytelling with the power of Python. Led by Jayesh Kothari, a Python enthusiast and data storytelling expert, this session promises to be both informative and engaging.", "description": "Through hands-on exercises and real-world examples, attendees will learn how to leverage Python's data manipulation and visualization libraries to craft compelling narratives from raw data. Participants will discover the secrets of weaving data into impactful stories, enabling them to communicate complex insights effectively.\r\n\r\nWhether you're a seasoned Python developer or a data enthusiast, this workshop offers valuable skills to enhance your storytelling prowess and leave a lasting impression on your audience. Join us for an enlightening experience at the Python Conference in Portugal.", "recording_license": "", "do_not_record": false, "persons": [{"id": 678, "code": "Z7MVME", "public_name": "Jayesh Kothari", "biography": "With a rich 12-year journey in the realm of Data Analytics, Data Visualization, and Data Storytelling, Jayesh is an expert in transforming data into compelling narratives that drive meaningful insights. He is proficient in low code, no code data analytics tools like Tableau, PowerBi, Alteryx & Dataiku with an in-depth knowledge of various relational databases & an expert in data visualization using Python.\r\nIn the past he had worked with renowned companies such as Atos Syntel, CouponDunia, and Infosys Currently he is busy in contributing to groundbreaking endeavors at Orsted, a global leader in green energy solutions.\r\nHe holds a degree in Computer Science Engineering from India and have furthered his knowledge with an executive program in Advanced Data Analytics from the prestigious Indian Institute of Management, Ahmedabad.\r\nHe is passionate bicyclist, data analytics speaker and an avid reader.", "answers": []}], "links": [], "attachments": [], "answers": []}, {"id": 542, "guid": "27ed0601-7914-5190-bd6e-ea54e1853176", "logo": "", "date": "2023-09-09T17:00:00+01:00", "start": "17:00", "duration": "02:00", "room": "Workshop II", "slug": "pycon-pt-2023-542-mastering-comprehensions", "url": "https://pretalx.evolutio.pt/pycon-pt-2023/talk/FFD9RU/", "title": "Mastering comprehensions", "subtitle": "", "track": null, "type": "Workshop", "language": "en", "abstract": "Practice how to write elegant comprehensions to make your code more idiomatic and easier to follow. With dozens of exercises, this tutorial will be perfect for you to finally get to grips with:\r\n\r\n • list comprehensions;\r\n • dictionary comprehensions;\r\n • set comprehensions; and\r\n • generator expressions.\r\n\r\nAmong other things, you will learn to identify situations where you should be using these powerful and elegant Python constructs. You will also learn how to use them to level up your Python skills.\r\n\r\nBy the end of the tutorial, you will learn all of the ins and outs of comprehensions, their use cases, best practices and things to avoid, and some advanced usage patterns as well!", "description": "The tutorial will start by presenting the simple anatomy of a list comprehension with a single looping construct and a single (optional) filter. We will motivate this anatomy from the point of view of a data transformation, which is an analogy that is well-received by audiences of all technical backgrounds and levels.\r\n\r\nThen, we will move on to solving exercises about common usage patterns, and then we will extend the idea of a list comprehension to set/dict comprehensions and generator expressions.\r\n\r\nFinally, we will deconstruct more advanced use cases, so that participants gain a clear understanding of all types of comprehensions.", "recording_license": "", "do_not_record": false, "persons": [{"id": 317, "code": "D33C79", "public_name": "Rodrigo Girão Serrão", "biography": "Rodrigo has always been fascinated by problem solving and that is why he picked up programming – so that he could solve more problems. He also loves sharing knowledge, and that is why he spends so much time writing articles in his blog [mathspp.com/blog](https://mathspp.com/blog), writing on Twitter [@mathsppblog](https://twitter.com/mathsppblog), and giving workshops and courses. You can also find his past talks on [github.com/mathspp/talks](https://github.com/mathspp/talks).\r\n\r\nHis main areas of scientific interest are mathematics (numerical analysis in particular) and programming in general (with a preference for the Python and APL languages), but Rodrigo also enjoys reading fantasy books, watching silly comedy movies and eating chocolate.", "answers": []}], "links": [], "attachments": [], "answers": []}]}}]}}}